package org.bta.lesson.lesson8;

public class HomeWork {

/*    Склад-магазин вместимостью до 6 автомобилей, который может хранить и продавать автомобили,
а так же накапливать деньги в кассе.
            1. Реализовать класс автомобиль у которго есть: цвет (может быть -
            Красный, белый, черный, применить константы(подумать какого типа они должны быть) ),
            вес (от 1200 до 2500 кг) и цена (от 80 000 до 400 000). Реализуйте в классе конструктор
            в котором все параметы автомобиля должны вводиться из консоли.
            Инкапсулируйте свойства класса так чтоб небыло возможности ввести некорректные
             данные(проверка в конструкторе+сеттеры).
            2. Реализуйте класс Склад-Магазин, который может хранить максимум 5 автомобилей.
            Склад магазин должен знать сколько автомобилей у него храниться и на каком они месте.
            3. Реализуйте метод "добавить автомобиль на склад" который добавляет автомобиль,
            и в случае если все места заняты просит продать какой то из автомобилей на складе.
             Под добавлением автомобиля подразумевается покупка за деньги, которы имеются в кассе
             и размешение его на любом первом попавшемся свободном месте.
4. Реализуйте метод "продать автомобиль" который может продать автомобиль из указанного места
на парковке. В результате продажи касса магазина пополняется деньгами. Причем цена продажи
автомобиля на 20 % выше стоимости автомобиля.
5. Реализуйте отчет, в котором можно увитеть состояние Склад-Магазина (подумайте сами,
какую информацию необходимо в него включить чтобы кнтролировать корректность работы магазина)
    Примените инкапсуляцию, к классу Склад-Магазин.*/
}
